# GetPlaneReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnPlane..::..GetPlaneReference Method
PointOnPlane Class See Also
---
The geometric plane reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetPlaneReference()
```

Visual Basic
---
```text
Public Function GetPlaneReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetPlaneReference()
```

# ### Return Value
A copy of the reference stored in the PointOnPlane object.
# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace